{
  "_note": "Web frontend backlog. Backend backlog archived in prd-backend.json.",
  "project_meta": {
    "name": "tilt-hydrometer-web",
    "version": "0.1.0",
    "ralph_type": "opencode",
    "opencode_session_id": "ralph-deep-init-web-2026-02-14"
  },
  "backlog": [
    {
      "group": "Project-Setup",
      "feature": "Initialize Vite React TypeScript project",
      "description": "Create the web/ directory using Vite with React and TypeScript template. Configure strict TypeScript via tsconfig.json. Install core dependencies: react-router-dom, @tanstack/react-query, recharts, date-fns, lucide-react. Set up VITE_API_URL environment variable with default to http://localhost:8000/api/v1. Verify the dev server starts with npm run dev.",
      "acceptance_criteria": [
        "web/ directory exists with Vite React TS project — verify with ls web/package.json and web/tsconfig.json",
        "TypeScript strict mode enabled in tsconfig.json — verify by reading compilerOptions.strict = true",
        "All core dependencies installed (react-router-dom, @tanstack/react-query, recharts, date-fns, lucide-react) — verify with npm ls in web/",
        "VITE_API_URL env var configured with default — verify by reading web/.env or web/src/lib/api.ts",
        "npm run dev starts Vite dev server without errors — verify by running command"
      ],
      "passes": true
    },
    {
      "group": "Project-Setup",
      "feature": "Configure TailwindCSS v4 and shadcn/ui",
      "description": "Install and configure TailwindCSS v4 in the Vite project. Initialize shadcn/ui with 'npx shadcn@latest init' choosing New York style, zinc base color, and CSS variables. Install initial shadcn components: button, card, input, label, badge, separator, dropdown-menu, dialog, table, toast, sonner. Verify Tailwind classes render correctly.",
      "acceptance_criteria": [
        "TailwindCSS v4 is installed and configured — verify by checking web/package.json and that utility classes render in browser",
        "shadcn/ui initialized with components.json config — verify by reading web/components.json",
        "All listed shadcn components installed in web/src/components/ui/ — verify with ls web/src/components/ui/",
        "A test page with a shadcn Button renders correctly — verify by viewing in browser"
      ],
      "passes": true
    },
    {
      "group": "Project-Setup",
      "feature": "TypeScript API types mirroring shared crate DTOs",
      "description": "Create web/src/types/ directory with TypeScript interfaces that mirror the Rust shared crate DTOs. Define: TiltColor (string union of 8 colors), TiltReading, CreateReadingsBatch, BrewStatus ('Active' | 'Completed' | 'Archived'), CreateBrew, UpdateBrew, BrewResponse, CreateHydrometer, UpdateHydrometer, HydrometerResponse, ReadingResponse, ReadingsQuery. All field names in camelCase matching the serde serialization.",
      "acceptance_criteria": [
        "web/src/types/index.ts exports all DTO interfaces — verify by reading file",
        "TiltColor is a union type of 8 color strings — verify by reading type definition",
        "BrewResponse interface has all fields matching Rust BrewResponse (id, name, style, og, fg, targetFg, abv, status, startDate, endDate, notes, hydrometerId, createdAt, updatedAt, latestReading) — verify by reading interface",
        "HydrometerResponse interface matches Rust HydrometerResponse — verify by reading interface",
        "ReadingResponse interface matches Rust ReadingResponse — verify by reading interface",
        "npm run build succeeds with no TypeScript errors — verify by running command"
      ],
      "passes": true
    },
    {
      "group": "Project-Setup",
      "feature": "API client and TanStack Query provider setup",
      "description": "Create web/src/lib/api.ts with a typed fetch wrapper that prepends VITE_API_URL to all requests, handles JSON parsing, and throws typed errors for non-2xx responses. Create web/src/lib/query-client.ts configuring a QueryClient with sensible defaults (staleTime 30s, retry 1). Wrap the app in QueryClientProvider in main.tsx. Create web/src/hooks/use-brews.ts, use-hydrometers.ts, use-readings.ts with TanStack Query hooks for each resource's CRUD operations.",
      "acceptance_criteria": [
        "web/src/lib/api.ts exports typed fetch functions (apiGet, apiPost, apiPut, apiDelete) — verify by reading file",
        "API client reads VITE_API_URL from import.meta.env — verify by reading file",
        "QueryClientProvider wraps the app in main.tsx — verify by reading file",
        "useBrews() hook returns { data, isLoading, error } from GET /brews — verify by reading hook file",
        "useHydrometers() hook exists with list/create/update/delete mutations — verify by reading hook file",
        "useReadings() hook accepts query params (brewId, since, until, limit) — verify by reading hook file",
        "npm run build succeeds — verify by running command"
      ],
      "passes": true
    },
    {
      "group": "Project-Setup",
      "feature": "React Router configuration with route structure",
      "description": "Set up React Router v7 in web/src/main.tsx with BrowserRouter. Create route structure: / (dashboard), /brews (brew list), /brews/:id (brew detail), /brews/new (create brew), /hydrometers (hydrometer list). Create placeholder page components in web/src/pages/ for each route. Configure a 404 catch-all route.",
      "acceptance_criteria": [
        "BrowserRouter configured in main.tsx — verify by reading file",
        "Routes defined for /, /brews, /brews/:id, /brews/new, /hydrometers — verify by reading router config",
        "Placeholder page components exist in web/src/pages/ (dashboard.tsx, brew-list.tsx, brew-detail.tsx, brew-new.tsx, hydrometer-list.tsx) — verify with ls",
        "404 catch-all route renders a not-found page — verify by reading router config",
        "Navigation between routes works — verify by clicking links in browser"
      ],
      "passes": true
    },
    {
      "group": "Layout-Navigation",
      "feature": "App shell with sidebar navigation",
      "description": "Create web/src/components/layout/app-shell.tsx as the root layout component. It should render a fixed sidebar on the left (collapsible on mobile) and a main content area. The sidebar contains the app logo/title ('Tilt Dashboard'), navigation links (Dashboard, Brews, Hydrometers), and a footer with version info. Use shadcn/ui components and Lucide icons (LayoutDashboard, Beer, Thermometer). The layout should use an Outlet from React Router for nested route rendering.",
      "acceptance_criteria": [
        "AppShell component renders sidebar + main content area — verify by viewing in browser",
        "Sidebar has nav links: Dashboard (/), Brews (/brews), Hydrometers (/hydrometers) — verify by reading source and clicking links",
        "Active route is visually highlighted in sidebar — verify by navigating and checking active state styling",
        "Lucide icons rendered next to each nav label — verify by viewing in browser",
        "React Router Outlet renders child route content — verify by navigating between routes"
      ],
      "passes": true
    },
    {
      "group": "Layout-Navigation",
      "feature": "Responsive mobile navigation",
      "description": "Make the sidebar responsive: on screens below md breakpoint, the sidebar collapses into a hamburger menu button in a top header bar. Clicking the hamburger opens a Sheet (shadcn/ui) sliding panel with the same navigation links. The Sheet closes on link click or outside click. Add the shadcn Sheet component if not already installed.",
      "acceptance_criteria": [
        "Sidebar hidden on mobile (below md breakpoint) — verify by resizing browser window",
        "Hamburger menu button appears in top header on mobile — verify by viewing at mobile width",
        "Clicking hamburger opens Sheet with nav links — verify by clicking in browser",
        "Sheet closes when a nav link is clicked — verify by clicking a link",
        "Sheet closes on outside click / overlay click — verify by clicking overlay"
      ],
      "passes": true
    },
    {
      "group": "Layout-Navigation",
      "feature": "Page header component with breadcrumbs",
      "description": "Create web/src/components/layout/page-header.tsx that accepts title (string), description (optional string), and actions (optional ReactNode for action buttons). Create web/src/components/layout/breadcrumbs.tsx that reads the current route path and renders breadcrumb links (e.g., Dashboard > Brews > My IPA). Use these in all page components for consistent headers.",
      "acceptance_criteria": [
        "PageHeader renders title and optional description — verify by reading source and viewing in browser",
        "PageHeader renders optional action buttons slot on the right — verify by passing a button as actions prop",
        "Breadcrumbs component renders path segments as clickable links — verify by navigating to /brews/:id and seeing breadcrumbs",
        "Breadcrumb home link goes to / — verify by clicking"
      ],
      "passes": true
    },
    {
      "group": "Layout-Navigation",
      "feature": "Toast notification system",
      "description": "Set up the Sonner toast notification system (shadcn/ui's toast solution). Add the Toaster component to the app shell. Create a helper utility web/src/lib/toast.ts that exports success(), error(), and info() functions wrapping Sonner's toast API. Use these in mutation hooks to show success/error feedback on CRUD operations.",
      "acceptance_criteria": [
        "Sonner Toaster component rendered in app shell — verify by reading app-shell.tsx",
        "toast.success('message') shows a green success toast — verify by calling from a button click",
        "toast.error('message') shows a red error toast — verify by triggering an error",
        "Toasts auto-dismiss after 4 seconds — verify by observing behavior",
        "npm run build succeeds — verify by running command"
      ],
      "passes": true
    },
    {
      "group": "Dashboard",
      "feature": "Dashboard summary cards",
      "description": "Create web/src/pages/dashboard.tsx as the main landing page. Display summary cards using shadcn Card components: Active Brews count, Total Hydrometers count, Latest Reading (temperature + gravity from most recent reading across all hydrometers), and Readings Today count. Each card uses TanStack Query hooks to fetch data from the API. Show loading skeletons while data loads.",
      "acceptance_criteria": [
        "Dashboard page renders 4 summary cards in a responsive grid (2x2 on desktop, stacked on mobile) — verify by viewing in browser",
        "Active Brews card shows count from GET /brews?status=Active — verify by reading source and checking API call",
        "Total Hydrometers card shows count from GET /hydrometers — verify by reading source",
        "Latest Reading card shows most recent temperature and gravity — verify by reading source",
        "Loading skeleton placeholders shown while queries are pending — verify by throttling network in devtools"
      ],
      "passes": true
    },
    {
      "group": "Dashboard",
      "feature": "Active brews quick-view list",
      "description": "Below the summary cards on the dashboard, render a section titled 'Active Brews' showing a compact list of all brews with status=Active. Each row shows: brew name, hydrometer color (as a colored dot), current gravity (from latest reading), days since start_date, and a link to the brew detail page. If no active brews, show an empty state with a 'Start a Brew' button linking to /brews/new.",
      "acceptance_criteria": [
        "Active brews section renders below summary cards — verify by viewing in browser",
        "Each brew row shows name, color dot, current gravity, days active — verify by reading source",
        "Clicking a brew row navigates to /brews/:id — verify by clicking",
        "Empty state shown with 'Start a Brew' button when no active brews — verify by testing with empty API response",
        "Color dot matches the hydrometer's TiltColor — verify by viewing with colored hydrometers"
      ],
      "passes": true
    },
    {
      "group": "Dashboard",
      "feature": "Recent readings mini-chart",
      "description": "Add a Recharts LineChart to the dashboard showing the last 24 hours of gravity readings across all active brews. X-axis is time (formatted with date-fns), Y-axis is specific gravity. Each brew is a separate colored line. Use TanStack Query to fetch readings with since=24h filter. Include a chart legend identifying each brew by name. Show a loading skeleton while data loads.",
      "acceptance_criteria": [
        "Recharts LineChart renders on dashboard — verify by viewing in browser",
        "X-axis shows time labels formatted as HH:mm — verify by viewing chart",
        "Y-axis shows specific gravity values (e.g., 1.000–1.100) — verify by viewing chart",
        "Multiple brews render as separate colored lines with legend — verify by viewing with multiple active brews",
        "Chart fetches readings with since parameter for last 24h — verify by inspecting network requests"
      ],
      "passes": true
    },
    {
      "group": "Dashboard",
      "feature": "Auto-refresh with configurable interval",
      "description": "Configure the dashboard's TanStack Query hooks with a refetchInterval of 30 seconds so data updates automatically without manual refresh. Add a visual indicator (small pulsing dot or timestamp) showing when data was last refreshed. Add a manual refresh button (RefreshCw icon) that invalidates all dashboard queries immediately.",
      "acceptance_criteria": [
        "Dashboard data auto-refreshes every 30 seconds — verify by watching network tab for periodic requests",
        "Last refreshed timestamp displayed on dashboard — verify by viewing in browser",
        "Manual refresh button triggers immediate refetch — verify by clicking and watching network tab",
        "RefreshCw icon animates (spins) during refetch — verify by clicking refresh and observing animation"
      ],
      "passes": true
    },
    {
      "group": "Brew-Management",
      "feature": "Brew list page with status filtering",
      "description": "Create web/src/pages/brew-list.tsx displaying all brews in a shadcn Table. Columns: Name, Style, Hydrometer (color dot + name), Status (Badge with color coding: Active=green, Completed=blue, Archived=gray), OG, Current SG, ABV, Start Date. Add a status filter using shadcn Tabs or ToggleGroup (All, Active, Completed, Archived) that passes ?status= query param to the API. Include a 'New Brew' button in the page header linking to /brews/new. Show loading skeleton rows while data loads and an empty state when no brews exist.",
      "acceptance_criteria": [
        "Brew list table renders with all specified columns — verify by viewing in browser with seed data",
        "Status badges are color-coded (Active=green, Completed=blue, Archived=gray) — verify by viewing",
        "Status filter tabs filter the brew list via API query param — verify by clicking each tab and checking network requests",
        "Clicking a brew row navigates to /brews/:id — verify by clicking",
        "'New Brew' button in header links to /brews/new — verify by clicking",
        "Empty state shown when no brews match filter — verify by selecting a filter with no results"
      ],
      "passes": true
    },
    {
      "group": "Brew-Management",
      "feature": "Create brew form page",
      "description": "Create web/src/pages/brew-new.tsx with a form for creating a new brew. Fields: Name (required text input), Style (optional text input), Hydrometer (required select dropdown populated from GET /hydrometers), OG (optional number input), Target FG (optional number input), Notes (optional textarea). Use shadcn form components (Input, Label, Select, Textarea). On submit, POST to /brews and navigate to the new brew's detail page on success. Show validation errors inline and a toast on success/failure.",
      "acceptance_criteria": [
        "Create brew form renders with all specified fields — verify by viewing in browser",
        "Hydrometer dropdown populated from API — verify by checking network request for GET /hydrometers",
        "Name field is required — verify by submitting empty form and seeing validation error",
        "Successful submission POSTs to /brews and redirects to /brews/:id — verify by filling form and submitting",
        "Success toast shown on creation — verify by observing toast after submit",
        "Error toast shown on API failure — verify by testing with server down"
      ],
      "passes": true
    },
    {
      "group": "Brew-Management",
      "feature": "Brew detail page with readings summary",
      "description": "Create web/src/pages/brew-detail.tsx that fetches a single brew by ID (GET /brews/:id) and displays its full details. Show: brew name as page title, status badge, style, OG/FG/Target FG/ABV in a stats grid, hydrometer info, start/end dates formatted with date-fns, and notes. Below the details, show a 'Readings' section (placeholder for now — will be filled by Readings-Visualization group). Add action buttons in the page header: Edit (opens edit dialog), Complete Brew, Archive Brew, Delete Brew (with confirmation dialog).",
      "acceptance_criteria": [
        "Brew detail page fetches and displays brew data — verify by navigating to /brews/:id",
        "Stats grid shows OG, FG, Target FG, ABV — verify by viewing in browser",
        "Status badge matches brew status — verify by viewing",
        "Dates formatted with date-fns (e.g., 'Feb 14, 2026') — verify by viewing",
        "Edit button opens edit dialog/form — verify by clicking",
        "Delete button shows confirmation dialog before deleting — verify by clicking",
        "Complete/Archive buttons update brew status via API — verify by clicking and checking status change"
      ],
      "passes": true
    },
    {
      "group": "Brew-Management",
      "feature": "Edit brew dialog with inline updates",
      "description": "Create web/src/components/brew/edit-brew-dialog.tsx as a shadcn Dialog that pre-fills form fields with the current brew data. Fields: Name, Style, OG, FG, Target FG, ABV, Notes, Status (select). On submit, PUT to /brews/:id. Invalidate the brew detail query on success so the page refreshes. Show toast on success/error. Cancel button closes the dialog without changes.",
      "acceptance_criteria": [
        "Edit dialog opens pre-filled with current brew data — verify by clicking Edit on brew detail page",
        "All editable fields present: Name, Style, OG, FG, Target FG, ABV, Notes, Status — verify by viewing dialog",
        "Submitting sends PUT /brews/:id with updated fields — verify by editing and checking network request",
        "Brew detail page refreshes with new data after successful edit — verify by editing and observing page update",
        "Success toast shown after edit — verify by observing",
        "Cancel closes dialog without API call — verify by clicking Cancel and checking no network request"
      ],
      "passes": true
    },
    {
      "group": "Brew-Management",
      "feature": "Delete brew with confirmation",
      "description": "Create web/src/components/brew/delete-brew-dialog.tsx as a shadcn AlertDialog that confirms deletion. Shows brew name and a warning message. On confirm, DELETE /brews/:id, show success toast, and navigate back to /brews. On cancel, close dialog. Use the useMutation hook with onSuccess callback to invalidate queries and redirect.",
      "acceptance_criteria": [
        "Delete confirmation dialog shows brew name and warning — verify by clicking Delete on brew detail",
        "Confirming sends DELETE /brews/:id — verify by confirming and checking network request",
        "Success toast and redirect to /brews after deletion — verify by confirming delete",
        "Cancel closes dialog without API call — verify by clicking Cancel",
        "Brew list refreshes (query invalidated) after deletion — verify by checking brew is gone from list"
      ],
      "passes": true
    },
    {
      "group": "Readings-Visualization",
      "feature": "Gravity and temperature line charts on brew detail",
      "description": "Create web/src/components/readings/readings-chart.tsx using Recharts. Render a dual-axis LineChart: left Y-axis for specific gravity (e.g., 1.000–1.100), right Y-axis for temperature (°F), X-axis for time (formatted with date-fns). Gravity line in blue, temperature line in orange. Accept brewId prop and fetch readings via useReadings(brewId). Support time range selection (Last 24h, Last 7d, Last 30d, All) via buttons that adjust the 'since' query param. Include tooltips showing exact values on hover. Responsive — fills container width.",
      "acceptance_criteria": [
        "Dual-axis LineChart renders gravity (left axis) and temperature (right axis) — verify by viewing on brew detail page",
        "X-axis shows time labels formatted appropriately for the selected range — verify by viewing chart",
        "Tooltip on hover shows exact gravity, temperature, and timestamp — verify by hovering over data points",
        "Time range selector buttons (24h, 7d, 30d, All) filter the displayed data — verify by clicking each and watching chart update",
        "Chart is responsive and fills container width — verify by resizing browser"
      ],
      "passes": true
    },
    {
      "group": "Readings-Visualization",
      "feature": "Readings data table with pagination",
      "description": "Create web/src/components/readings/readings-table.tsx showing readings in a shadcn Table below the chart on the brew detail page. Columns: Recorded At (formatted datetime), Temperature (°F), Gravity (SG), RSSI (if available). Sort by recorded_at DESC by default. Implement client-side pagination (25 rows per page) with Previous/Next buttons. Accept brewId prop and reuse the useReadings hook.",
      "acceptance_criteria": [
        "Readings table renders with Recorded At, Temperature, Gravity, RSSI columns — verify by viewing on brew detail page",
        "Rows sorted by recorded_at DESC (newest first) — verify by checking row order",
        "Pagination shows 25 rows per page with Previous/Next controls — verify by navigating pages",
        "Pagination state resets when brewId changes — verify by navigating between brews",
        "Empty state shown when no readings exist — verify with a brew that has no readings"
      ],
      "passes": false
    },
    {
      "group": "Readings-Visualization",
      "feature": "Fermentation progress indicators",
      "description": "Create web/src/components/readings/fermentation-stats.tsx that calculates and displays fermentation metrics from the readings data. Show: Current Gravity (latest reading), Apparent Attenuation (% = (OG - current) / (OG - 1.0) * 100), Estimated ABV ((OG - current) * 131.25), Temperature Trend (arrow up/down/steady based on last 3 readings), Time Since Last Reading (formatted with date-fns formatDistanceToNow). Display as a row of stat cards above the chart on the brew detail page.",
      "acceptance_criteria": [
        "Fermentation stats render as a row of cards above the chart — verify by viewing brew detail page",
        "Current Gravity shows the latest reading's gravity value — verify by checking against API data",
        "Apparent Attenuation calculated correctly from OG and current gravity — verify with known values",
        "Estimated ABV calculated correctly — verify with known values (e.g., OG 1.050, FG 1.010 = ~5.25%)",
        "Temperature Trend shows up/down/steady arrow — verify by checking with readings that have varying temperatures",
        "Time Since Last Reading shows human-readable duration (e.g., '5 minutes ago') — verify by viewing"
      ],
      "passes": false
    },
    {
      "group": "Readings-Visualization",
      "feature": "Gravity target line and completion detection",
      "description": "Enhance the readings chart to display the brew's Target FG as a horizontal dashed reference line (green) when set. When the current gravity reaches or goes below the Target FG, show a visual alert banner on the brew detail page: 'Target gravity reached! Consider completing this brew.' with a 'Complete Brew' action button that sets the brew status to Completed via PUT /brews/:id.",
      "acceptance_criteria": [
        "Target FG dashed line renders on chart when brew has targetFg set — verify by viewing chart for a brew with targetFg",
        "Target FG line does not render when targetFg is null — verify with a brew without targetFg",
        "Alert banner appears when latest gravity <= targetFg — verify by checking with appropriate data",
        "Alert banner 'Complete Brew' button sends PUT to update status — verify by clicking and checking network",
        "Alert banner hidden when gravity is above targetFg — verify with appropriate data"
      ],
      "passes": false
    },
    {
      "group": "Hydrometer-Management",
      "feature": "Hydrometer list page with status indicators",
      "description": "Create web/src/pages/hydrometer-list.tsx displaying all registered hydrometers in a responsive card grid (not a table — cards work better for the small number of hydrometers). Each card shows: color name with a large colored circle matching the Tilt color, optional alias name, calibration offsets (temp_offset_f, gravity_offset), registration date formatted with date-fns, and whether it's currently assigned to an active brew (with brew name link). Add a 'Register Hydrometer' button in the page header. Use the useHydrometers() hook.",
      "acceptance_criteria": [
        "Hydrometer cards render in a responsive grid (3 columns desktop, 2 tablet, 1 mobile) — verify by viewing and resizing browser",
        "Each card shows colored circle matching TiltColor (Red=#FF0000, Green=#00FF00, etc.) — verify by viewing",
        "Active brew assignment shown on card with link to brew detail — verify by clicking brew link",
        "'Register Hydrometer' button in page header — verify by viewing",
        "Empty state shown when no hydrometers registered — verify with empty API response"
      ],
      "passes": false
    },
    {
      "group": "Hydrometer-Management",
      "feature": "Register hydrometer dialog",
      "description": "Create web/src/components/hydrometer/register-hydrometer-dialog.tsx as a shadcn Dialog with a form. Fields: Color (required Select dropdown with all 8 TiltColor options, each with a colored dot preview), Name/Alias (optional text input). On submit, POST to /hydrometers. Show success toast and invalidate the hydrometer list query. Only show colors that aren't already registered (fetch existing and filter).",
      "acceptance_criteria": [
        "Register dialog opens from 'Register Hydrometer' button — verify by clicking button",
        "Color select shows all 8 TiltColor options with colored dot previews — verify by opening select",
        "Already-registered colors are filtered out or disabled — verify by registering one color and checking it's unavailable",
        "Successful registration shows toast and new card appears in list — verify by submitting form",
        "Name/alias field is optional — verify by submitting with only color selected"
      ],
      "passes": false
    },
    {
      "group": "Hydrometer-Management",
      "feature": "Edit hydrometer dialog with calibration offsets",
      "description": "Create web/src/components/hydrometer/edit-hydrometer-dialog.tsx as a shadcn Dialog for editing hydrometer settings. Fields: Name/Alias (text input), Temperature Offset °F (number input with step 0.1, help text explaining this adjusts raw temperature readings), Gravity Offset (number input with step 0.001, help text explaining this adjusts raw gravity readings). On submit, PUT to /hydrometers/:id. Show toast on success and invalidate queries.",
      "acceptance_criteria": [
        "Edit dialog opens pre-filled with current hydrometer data — verify by clicking edit on a hydrometer card",
        "Temperature Offset input accepts decimal values with step 0.1 — verify by entering 0.5",
        "Gravity Offset input accepts decimal values with step 0.001 — verify by entering 0.002",
        "Help text explains what each offset does — verify by reading form labels",
        "Successful edit updates the card and shows toast — verify by editing and observing"
      ],
      "passes": false
    },
    {
      "group": "Hydrometer-Management",
      "feature": "Delete hydrometer with safety check",
      "description": "Add a delete button to each hydrometer card that opens a shadcn AlertDialog. If the hydrometer is assigned to an active brew, show a warning: 'This hydrometer is assigned to an active brew. Deleting it will unlink it.' On confirm, DELETE /hydrometers/:id, show toast, and invalidate queries. Disable delete for hydrometers with active brews unless user confirms the warning.",
      "acceptance_criteria": [
        "Delete button visible on each hydrometer card — verify by viewing",
        "Confirmation dialog shows hydrometer color and name — verify by clicking delete",
        "Warning shown when hydrometer has active brew — verify with an assigned hydrometer",
        "Successful deletion removes card and shows toast — verify by confirming delete",
        "Cancel closes dialog without API call — verify by clicking cancel"
      ],
      "passes": false
    },
    {
      "group": "Hydrometer-Management",
      "feature": "Tilt color utility with hex color mapping",
      "description": "Create web/src/lib/tilt-colors.ts that exports a mapping from TiltColor string to: hex color code, display name, and a lighter background variant for cards. Colors: Red=#E03131, Green=#2F9E44, Black=#495057, Purple=#7048E8, Orange=#E8590C, Blue=#1971C2, Yellow=#F08C00, Pink=#D6336C. Export a ColorDot component (web/src/components/ui/color-dot.tsx) that renders a small circle with the correct color. Use this everywhere hydrometers are displayed.",
      "acceptance_criteria": [
        "web/src/lib/tilt-colors.ts exports TILT_COLOR_MAP with hex, displayName, bgLight for all 8 colors — verify by reading file",
        "ColorDot component renders a circle with correct color for each TiltColor — verify by viewing all 8 colors",
        "ColorDot used in hydrometer cards, brew list, and dashboard — verify by searching source for ColorDot usage",
        "npm run build succeeds with no type errors — verify by running command"
      ],
      "passes": false
    }
  ]
}
